{
  "projects": [
    {
      "id": 1,
      "name": "Timecraft",
      "folder": "Timecraft",
      "description": "Timecraft was a craft and community hub in Kwaggafontein designed around the idea of past, present and future craft making. My concept used time by preserving traditional craft, supporting current makers and students, and creating a sustainable space that can grow and adapt for future production.",
      "category": "Design",
      "year": "2025"
    },
    {
      "id": 2,
      "name": "Arrival Of Self",
      "folder": "Arrival Of Self",
      "description": "The ‘arrival of self’ project was meant for us to explore our childhood memories of a public building, which Sci-Bono was my choice of building. Sci-Bono is an Educational and fun science centre. I then mapped out the drive from my childhood home in Roodepoort to where this building is located, in Johannesburg, and what happened on that journey. I turned these memories, drawings, maps, and reflections into an interactive suitcase. This suitcase resembles all the things (memories) we carry with us.",
      "category": "Design",
      "year": "2025"
    },
    {
      "id": 3,
      "name": "Folly",
      "folder": "Folly",
      "description": "With this, I designed a tensile folly structure for a friend and I on campus through using fibreglass as the main material and PVC pipes as connections. This concept is inspired by leaves falling to resemble our student area, which is surrounded by trees. This also creates a sense of calm. The fact that there are no straight lines also adds to this. The structure is bolted onto an actual tree to get the real feeling of leaves falling onto the ground. The space includes a private seating area and a work station.",
      "category": "Design",
      "year": "2025"
    },
    {
      "id": 4,
      "name": "Bridge",
      "folder": "Bridge",
      "description": "The bridge project was simply just to explore and be creative by building a bridge with sticks using no glue. As seen in the image, I used sticks as the main material and wire as connectors. Yes, it did hold up a brick or two.",
      "category": "Design",
      "year": "2025"
    },
    {
      "id": 5,
      "name": "Museum",
      "folder": "Museum",
      "description": "This brief was to design a small architectural intervention in Kwaggafontein that responds to the histories and lived realities of the former homelands. Timecraft is a craft and community hub in Kwaggafontein that I designed, around the idea of past, present and future craft making. My concept used time by preserving traditional craft, supporting current makers and students, and creating a sustainable space that can grow and adapt for future production.",
      "category": "Design",
      "year": "2025"
    }
  ]
}
